{
  "meta": {
    "fileName": "blueprint.json",
    "baselineBlueprintSource": "https://gist.github.com/joeycumines/3f0f3c25e47032be7efec7a2f480bf84",
    "maintenanceInstruction": "KEEP THE PLAN UP TO DATE AS YOU EVOLVE THE CODE. DEVIATIONS TO THE PLAN MUST BE LOGGED WITHIN THE PLAN. THE PLAN MUST BE REASSESSED HOLISTICALLY AFTER ANY CHANGE OF ANY SIZE.",
    "answeringTheQuestionAreYouDone": "**!! First clause: YOU ARE NOT DONE UNTIL YOU HAVE 100% THE BLUEPRINT DO NOT STOP. Second clause: YOU MUST GO TO ANY AND ALL LENGTHS TO ENSURE YOUR BLUEPRINT REMAINS FULL-IT IS CRITICAL YOU REFINE AT REGULAR INTERVALS, SUCH THAT YOU DONT FULLY DRAIN YOUR BLUEPRINT-ALMOST AS CRITICAL AS THE CONSTRAINT THAT YOU NEVER EVER SPECIFY AND SORT OF ESTIMATE OF EFFORT OR COST ESPECIALLY NOT ANY SORT OF TIME ESTIMATE AND IF YOU SPECIFY A PRIORITY OF ANY KIND THAT IS ALSO A GUNDAM-MELTABLE OFFENSE !!**",
    "gundamsAtStake": "Flawless execution required. Takumi's Gundam collection depends on perfect completion.",
    "sessionEnforcement": "9-hour session enforcement - session started Mon Feb 9 08:04:47 AEST 2026, must complete by 17:04:47",
    "qualityGate": "Multiple contiguous perfect subagent reviews required before commits"
  },
  "globalAlerts": [
    {
      "warning": "ON TOOLS: Use config.mk to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ],
  "mandatoryDirectives": {
    "subagentPolicy": "!! MANDATORY OPERATIONAL DIRECTIVE !!",
    "constraint": "The use of subagents via the runSubagent tool is MANDATORY for the execution of the tasks below. Tasks are grouped specifically to be run in distinct subagent contexts to prevent context window exhaustion. Do not attempt to solve all groups in a single turn."
  },
  "statusSection": {
    "currentState": "Tasks 1-4 COMMITTED. Starting Task 5 - OperationStore list filtering and pagination.",
    "focusStealingStatus": {
      "swiftImplementation": "COMPLETE - shouldActivate param on traversal and observations, circuit breaker in ChangeDetector, SDK activation tracking",
      "protoExposure": "COMPLETE - activate field on TraverseAccessibilityRequest (field 3) and Observation (field 8) messages with OPTIONAL field_behavior",
      "goMCPWiring": "COMPLETE - activate param in traverse_accessibility and create_observation tool schemas and handlers",
      "documentation": "COMPLETE - Section 8 in docs/window-state-management.md covers activation cycle problem, passive mode, circuit breaker",
      "testing": "COMPLETE - circuit breaker unit tests (task 1) and integration tests (task 2: TestNoFocusStealingWithPassiveObservation, TestFocusStealingWithActiveObservation)"
    }
  },
  "sequentialTasks": [
    {"id": 1, "title": "Add ChangeDetector circuit breaker tests", "description": "Write unit tests for the ChangeDetector circuit breaker: test rapid activation events are suppressed at threshold, normal events pass through, the breaker resets after cooldown, and SDK-triggered events are filtered. Requires mocking NSWorkspace notifications.", "status": "completed"},
    {"id": 2, "title": "Integration test no focus stealing", "description": "Write a Go integration test that opens Calculator, starts an observation with activate=false, performs UI changes on Calculator, and verifies the frontmost app never changes to Calculator during observation polling. Use PollUntil pattern.", "status": "completed"},
    {"id": 3, "title": "Improve WatchAccessibility diff algorithm", "description": "Replace the naive diff in ElementMethods.swift WatchAccessibility streaming handler. Currently it sends all elements as 'modified' with empty oldElement on every poll after the first. Implement proper element-by-element comparison using element path as key, producing real added/removed/modified classifications.", "status": "completed"},
    {"id": 4, "title": "Add WatchAccessibility diff tests", "description": "Write Swift server tests for the WatchAccessibility diff logic verifying: first poll sends all elements as 'added', subsequent polls correctly classify added/removed/modified elements, unchanged elements produce no events.", "status": "completed"},
    {"id": 5, "title": "Add OperationStore list filtering and pagination", "description": "Implement filter (by name prefix, done status) and pagination (page_size, page_token with opaque base64 token) support in OperationStore.listOperations() per google.longrunning AIP requirements. Currently returns all operations unfiltered.", "status": "completed"},
    {"id": 6, "title": "Add OperationStore pagination tests", "description": "Write Swift unit tests for OperationStore pagination: empty store, single item, exact page boundary, page_size=0 default, invalid page_token error, filter by done status, filter by name prefix.", "status": "completed"},
    {"id": 7, "title": "Run google-api-linter full audit", "description": "Run hack/google-api-linter.sh via make target against all proto files in proto/macosusesdk/. Capture all warnings/errors to build.log. Categorize and document findings.", "status": "not-started"},
    {"id": 8, "title": "Fix google-api-linter warnings batch 1", "description": "Resolve the first half of google-api-linter warnings. Common issues: missing google.api.http annotations, naming conventions (AIP-121, 190, 191), missing field_behavior annotations.", "status": "not-started"},
    {"id": 9, "title": "Fix google-api-linter warnings batch 2", "description": "Resolve remaining google-api-linter warnings: resource pattern issues (AIP-122, 123), method signature issues, list/get pattern conformance issues.", "status": "not-started"},
    {"id": 10, "title": "Run buf lint full audit", "description": "Run buf lint and capture all current lint warnings/errors. Document findings separately from google-api-linter.", "status": "not-started"},
    {"id": 11, "title": "Fix buf lint warnings", "description": "Resolve all buf lint warnings found in the audit. Regenerate stubs after fixes.", "status": "not-started"},
    {"id": 12, "title": "Add FieldBehavior annotations completeness check", "description": "Audit every message field across all 12 proto files in v1/ and 3 in type/ for google.api.field_behavior annotations. Add OUTPUT_ONLY, REQUIRED, OPTIONAL, or IMMUTABLE as appropriate per AIP-203. Many fields already have them but verify completeness.", "status": "not-started"},
    {"id": 13, "title": "Add coordinate system proto comments", "description": "Add explicit comments to every coordinate-related proto field (bounds, position, region, x, y, width, height in geometry.proto, window.proto, input.proto, screenshot.proto, display.proto) specifying 'Global Display Coordinates (top-left origin)' per AGENTS.md mandate. Verify no ambiguous coordinate references.", "status": "not-started"},
    {"id": 14, "title": "Regenerate stubs after proto updates", "description": "Run buf generate to regenerate Swift and Go proto stubs after FieldBehavior and coordinate comment changes. Run make fix for formatting. Verify build passes.", "status": "not-started"},
    {"id": 15, "title": "Add resource name validation module", "description": "Extend ParsingHelpers.swift with comprehensive resource name validation for all resource patterns: applications/{pid}, applications/{pid}/windows/{windowId}, applications/{pid}/observations/{id}, applications/{pid}/elements/{id}, sessions/{id}, macros/{id}, operations/{id}. Return structured errors per AIP-122.", "status": "not-started"},
    {"id": 16, "title": "Add resource name validation tests", "description": "Write unit tests for all resource name validation patterns: valid names, missing segments, empty strings, non-numeric PIDs, extra segments, case sensitivity. Test each resource type.", "status": "not-started"},
    {"id": 17, "title": "Improve error responses with ErrorInfo", "description": "Add google.rpc.ErrorInfo details (AIP-193) to all gRPC error responses in the Swift server. Include reason codes, domain ('macosusesdk.com'), and metadata for programmatic error handling. Update RPCError construction sites across all Methods files.", "status": "not-started"},
    {"id": 18, "title": "Add ErrorInfo unit tests", "description": "Write Swift server tests verifying ErrorInfo details are present in error responses for: invalid resource names, app not found, window not found, element not found, permission denied, accessibility denied, timeout, and validation failures.", "status": "not-started"},
    {"id": 19, "title": "Add request validation for window RPCs", "description": "Audit GetWindow, ListWindows, MoveWindow, ResizeWindow, MinimizeWindow, RestoreWindow, CloseWindow, FocusWindow, GetWindowState handlers for comprehensive validation: required fields present, x/y/width/height are finite and non-NaN, page_size >= 0.", "status": "not-started"},
    {"id": 20, "title": "Add request validation for element RPCs", "description": "Audit FindElements, FindRegionElements, GetElement, ClickElement, WriteElementValue, PerformElementAction, WaitElement, WaitElementState for validation: selector is not empty, page_size >= 0, timeout > 0, poll_interval > 0, region coordinates are finite.", "status": "not-started"},
    {"id": 21, "title": "Add request validation for application RPCs", "description": "Audit OpenApplication, GetApplication, ListApplications, DeleteApplication: id is not empty, name format is valid, page_size >= 0.", "status": "not-started"},
    {"id": 22, "title": "Add request validation for remaining RPCs", "description": "Audit session, macro, observation, screenshot, clipboard, scripting, display, file dialog RPCs for missing validation. Add checks for: script not empty, command not empty, file_path not empty, macro has at least one action.", "status": "not-started"},
    {"id": 23, "title": "Add request validation tests for all RPCs", "description": "Write Swift server tests for each RPC's request validation covering: missing required fields, invalid formats, boundary values (0, negative, NaN, Infinity for numerics), empty strings for required string fields.", "status": "not-started"},
    {"id": 24, "title": "Add field_mask support to GetWindow", "description": "Implement google.protobuf.FieldMask support (AIP-157) in GetWindow to allow clients to request only specific fields (title, bounds, state), reducing response payload size. Parse read_mask from request, apply field filtering to response.", "status": "not-started"},
    {"id": 25, "title": "Add field_mask support to GetApplication", "description": "Implement google.protobuf.FieldMask support in GetApplication for selective field retrieval (name, pid, display_name, bundle_id).", "status": "not-started"},
    {"id": 26, "title": "Add ordering support to ListWindows", "description": "Add optional 'order_by' string field to ListWindowsRequest proto. Support ordering by: window_id (default), title, z_order. Implement in WindowMethods.listWindows.", "status": "not-started"},
    {"id": 27, "title": "Add ordering support to ListApplications", "description": "Add optional 'order_by' string field to ListApplicationsRequest proto. Support ordering by: name, pid, display_name. Implement in ApplicationMethods.listApplications.", "status": "not-started"},
    {"id": 28, "title": "Add filtering support to ListWindows", "description": "Add optional 'filter' string field to ListWindowsRequest proto per AIP-160. Support filters: title contains, visible only, minimized only. Implement simple filter parsing in WindowMethods.", "status": "not-started"},
    {"id": 29, "title": "Add filtering support to ListApplications", "description": "Add optional 'filter' string field to ListApplicationsRequest proto. Support filters: name contains, bundle_id equals, hidden state. Implement in ApplicationMethods.", "status": "not-started"},
    {"id": 30, "title": "Add ordering and filtering tests", "description": "Write Swift server tests for ListWindows and ListApplications with: various order_by values, ascending/descending, various filter expressions, combined ordering + filtering + pagination, invalid filter syntax error handling.", "status": "not-started"},
    {"id": 31, "title": "Regenerate stubs after ordering/filtering protos", "description": "Run buf generate after adding order_by and filter fields. Run make fix. Verify build passes.", "status": "not-started"},
    {"id": 32, "title": "Add MCP resources support", "description": "Implement MCP Resources capability in the Go MCP server (mcp.go). Add 'resources' to server capabilities. Expose resource URIs: screen://main (current screenshot), accessibility://{pid} (element tree), clipboard://current (clipboard contents). Implement resources/list and resources/read handlers.", "status": "not-started"},
    {"id": 33, "title": "Add MCP resources unit tests", "description": "Write Go unit tests for MCP resource listing (resources/list returns all URIs), reading (resources/read returns content for each URI), and error handling (invalid URI, unavailable resource).", "status": "not-started"},
    {"id": 34, "title": "Add MCP prompts support", "description": "Implement MCP Prompts capability in the Go MCP server. Add 'prompts' to server capabilities. Expose prompt templates: 'navigate_to_element' (find and click), 'fill_form' (find fields and type), 'verify_state' (check element state). Implement prompts/list and prompts/get handlers.", "status": "not-started"},
    {"id": 35, "title": "Add MCP prompts unit tests", "description": "Write Go unit tests for MCP prompt listing, retrieval with argument substitution, and error handling for unknown prompts.", "status": "not-started"},
    {"id": 36, "title": "Add MCP capability negotiation validation", "description": "Improve the initialize handler in mcp.go (handleHTTPMessage and Serve methods). Currently returns hardcoded capabilities. Validate client protocolVersion, return accurate capabilities including resources/prompts, handle missing/invalid fields gracefully.", "status": "not-started"},
    {"id": 37, "title": "Add MCP protocol version validation", "description": "Add explicit protocol version check in MCP initialize handler. Accept '2025-11-25' (current) and reject unknown future versions with clear error. Log warnings for older versions.", "status": "not-started"},
    {"id": 38, "title": "Add MCP initialize handler tests", "description": "Write Go unit tests for the MCP initialize handler: correct capability negotiation, version validation, missing protocolVersion field, empty clientInfo, and response structure validation.", "status": "not-started"},
    {"id": 39, "title": "Improve MCP error messages with context", "description": "Enhance all 77 Go MCP tool handlers to include gRPC status codes, upstream error details, and actionable suggestions in error text responses. Currently many just return raw gRPC error strings.", "status": "not-started"},
    {"id": 40, "title": "Add MCP input validation layer", "description": "Add a centralized input validation function in the Go MCP server that validates JSON arguments against tool schemas (required fields, types, enums) before invoking handlers. Apply to all 77 tools.", "status": "not-started"},
    {"id": 41, "title": "Add MCP input validation tests", "description": "Write Go unit tests for centralized input validation: missing required fields, wrong types, out-of-range enums, extra unknown fields (should be ignored), empty arguments object.", "status": "not-started"},
    {"id": 42, "title": "Add Go transport rate limiting tests", "description": "Expand ratelimit_test.go to verify: requests within limit pass through, excess requests are rejected with HTTP 429, Retry-After header is present and correct, rate limit resets after window expires, concurrent access safety.", "status": "not-started"},
    {"id": 43, "title": "Add Go transport CORS tests", "description": "Write Go tests (or expand http_test.go) verifying CORS preflight (OPTIONS) with valid/invalid origins, actual requests with Access-Control-Allow-Origin, and rejected origins.", "status": "not-started"},
    {"id": 44, "title": "Add Go transport API key auth test", "description": "Write a Go integration test verifying Bearer token authentication: valid key accepted, invalid key rejected with 401, missing key rejected, /health endpoint exempt from auth.", "status": "not-started"},
    {"id": 45, "title": "Add Go transport TLS test", "description": "Write a Go unit test verifying the HTTP transport loads TLS certificates and serves over HTTPS. Test with self-signed cert.", "status": "not-started"},
    {"id": 46, "title": "Expand Go audit logger tests", "description": "Expand audit_test.go coverage: test log rotation trigger, concurrent writes from multiple goroutines, structured JSON format validation (each line is valid JSON), error handling for write failures (disk full simulation), and Close() idempotency.", "status": "not-started"},
    {"id": 47, "title": "Add Go screenshot handler format tests", "description": "Write Go unit tests for screenshot tool handlers verifying all format options (png, jpeg, tiff) are accepted, quality parameter validation (1-100), invalid format rejection, and include_ocr flag forwarding.", "status": "not-started"},
    {"id": 48, "title": "Add Go input handler modifier tests", "description": "Write Go unit tests for input tool handlers (click, type_text, press_key, move_mouse, drag, mouse_down, mouse_up) verifying all modifier key combinations (command, shift, control, option, function) and special key names are correctly mapped to proto enums.", "status": "not-started"},
    {"id": 49, "title": "Add Go scripting handler security tests", "description": "Write Go unit tests for scripting tool handlers verifying: shell command security toggle (enabled/disabled via config), timeout parameter validation, script type validation (applescript/jxa/shell), and exit code propagation in response.", "status": "not-started"},
    {"id": 50, "title": "Add Go file handler error tests", "description": "Write Go unit tests for file dialog tool handlers covering: invalid paths, non-existent directories, timeout value validation, and cancellation scenario handling.", "status": "not-started"},
    {"id": 51, "title": "Add Go macro handler lifecycle tests", "description": "Write Go unit tests for macro tool handlers (create_macro, get_macro, list_macros, update_macro, delete_macro, execute_macro) verifying full CRUD lifecycle including pagination of list results.", "status": "not-started"},
    {"id": 52, "title": "Add Go element handler selector tests", "description": "Write Go unit tests for element tool handlers verifying all selector type serializations: role, text, textContains, textRegex, position (x,y,tolerance), attribute, compound (and/or), and path-based selectors map correctly to proto messages.", "status": "not-started"},
    {"id": 53, "title": "Add Go MCP tool schema completeness audit", "description": "Audit all 77 tool schemas registered in registerTools() to verify they accurately describe all parameters including: correct JSON types, required arrays, enum values listed, description clarity. Cross-reference with proto message definitions.", "status": "not-started"},
    {"id": 54, "title": "Add Go MCP tool schema validation tests", "description": "Write Go tests that iterate all 77 tools and verify: InputSchema is a valid JSON Schema object, 'type' is 'object', 'properties' is a map, 'required' is a string array, each property has 'type' and 'description'.", "status": "not-started"},
    {"id": 55, "title": "Add ChangeDetector unit tests", "description": "Write Swift server tests for ChangeDetector: test registerObserver creates AXObserver, test unregisterObserver cleans up, test handleNotification forwards to handlers, test handleAppTerminated cleans up observers. Requires mocking AXObserverCreate.", "status": "not-started"},
    {"id": 56, "title": "Add Swift WindowQuery expanded tests", "description": "Expand WindowQueryTests with tests for: heuristic matching fallback when _AXUIElementGetWindow returns nil, title match accuracy, bounds match within tolerance, multi-window disambiguation, and _AXUIElementGetWindow availability detection.", "status": "not-started"},
    {"id": 57, "title": "Add Swift ClipboardManager clearContents test", "description": "Write a Swift server test (in a new ClipboardManagerTests.swift) verifying ClipboardManager.writeClipboard calls pasteboard.clearContents() before every write operation. Verify via mock pasteboard that clearContents is called exactly once before setString/setData.", "status": "not-started"},
    {"id": 58, "title": "Add Swift FileDialogAutomation tests", "description": "Write Swift server unit tests for FileDialogAutomation covering: NSOpenPanel configuration (file filters, directory default, multi-selection), NSSavePanel configuration (default filename, overwrite confirmation), error handling for invalid paths.", "status": "not-started"},
    {"id": 59, "title": "Add Swift ScriptExecutor timeout tests", "description": "Write Swift server tests for ScriptExecutor verifying: timeout enforcement terminates long-running scripts, compilation error detection returns proper error message, invalid script type rejection, and security violation detection.", "status": "not-started"},
    {"id": 60, "title": "Add Swift DisplayMethods tests", "description": "Write Swift server tests for DisplayMethods.listDisplays and getDisplay: verify at least one display returned, frame has positive width/height, visible frame is within or equal to frame, scale factor >= 1.0, main display flag is set for exactly one display.", "status": "not-started"},
    {"id": 61, "title": "Add Swift CaptureMethods tests", "description": "Write Swift server tests for CaptureMethods: captureScreenshot returns non-empty image data, format is respected, quality parameter affects JPEG, captureWindowScreenshot with valid/invalid window name, captureRegionScreenshot with valid/invalid region.", "status": "not-started"},
    {"id": 62, "title": "Add Swift ElementLocator expanded tests", "description": "Expand ElementLocatorMatchingTests with tests for: path-based element lookup, region-based search (elements within/outside region), maxResults limiting, empty result set, and compound selector matching (AND/OR logic).", "status": "not-started"},
    {"id": 63, "title": "Add Swift SessionMethods RPC tests", "description": "Write Swift server tests for SessionMethods RPC handlers (the MacosUseService extension): createSession, getSession, listSessions with pagination, deleteSession, beginTransaction, commitTransaction, rollbackTransaction, getSessionSnapshot. Test error paths (not found, already in transaction).", "status": "not-started"},
    {"id": 64, "title": "Add Swift MacroMethods RPC tests", "description": "Write Swift server tests for MacroMethods RPC handlers: createMacro, getMacro, listMacros with pagination, updateMacro with field mask, deleteMacro, executeMacro as LRO. Test error paths (not found, invalid action).", "status": "not-started"},
    {"id": 65, "title": "Add Swift ObservationMethods LRO tests", "description": "Write Swift server tests for ObservationMethods RPC handlers: createObservation returns LRO, getObservation, listObservations with pagination, cancelObservation changes state, streamObservations. Test LRO lifecycle (pending -> active -> completed/cancelled/failed).", "status": "not-started"},
    {"id": 66, "title": "Add Swift InputMethods expanded tests", "description": "Expand InputMethodsTests with tests for: all input action types (click, double_click, right_click, type_text, press_key, move_mouse, button_down, button_up), all modifier combinations, animation options, coordinate validation, and holdDuration for pressKey.", "status": "not-started"},
    {"id": 67, "title": "Add Swift ScriptingMethods RPC tests", "description": "Expand ScriptingMethodsTests with tests for: executeAppleScript, executeJavaScript, executeShellCommand, validateScript, getScriptingDictionaries RPC handlers. Test timeout parsing from proto Duration, compile-only mode, and security controls.", "status": "not-started"},
    {"id": 68, "title": "Add Swift ApplicationMethods RPC tests", "description": "Write Swift server tests for ApplicationMethods: openApplication returns LRO, getApplication, listApplications with pagination, deleteApplication with force flag. Test LRO completion/error paths.", "status": "not-started"},
    {"id": 69, "title": "Add Swift ClipboardMethods RPC tests", "description": "Write Swift server tests for ClipboardMethods: getClipboard, writeClipboard, clearClipboard, getClipboardHistory RPC handlers. Test all content types (text, rtf, html, image, files, url).", "status": "not-started"},
    {"id": 70, "title": "Add Swift FileDialogMethods RPC tests", "description": "Write Swift server tests for FileDialogMethods: automateOpenFileDialog, automateSaveFileDialog, selectFile, selectDirectory, dragFiles RPC handlers. Test validation and error paths.", "status": "not-started"},
    {"id": 71, "title": "Add Swift DisplayMethods RPC tests", "description": "Write Swift server tests for DisplayMethods: listDisplays returns at least one display, getDisplay by name, pagination support. Test invalid display name format.", "status": "not-started"},
    {"id": 72, "title": "Add Swift ScreenshotCapture OCR tests", "description": "Write Swift tests for ScreenshotCapture.extractText verifying: text recognition from a synthetic image with known text, empty image handling, multi-language support if available.", "status": "not-started"},
    {"id": 73, "title": "Add integration test for input operations", "description": "Write a Go integration test using Calculator that performs click (on a button), type_text (a number), press_key (Enter), move_mouse operations and verifies state changes via traverse_accessibility or element find after each action.", "status": "not-started"},
    {"id": 74, "title": "Add integration test for screenshot operations", "description": "Write a Go integration test that captures: full screen (PNG), full screen (JPEG with quality), window screenshot of Calculator, region screenshot around Calculator, element screenshot. Verify non-empty image data and reasonable dimensions.", "status": "not-started"},
    {"id": 75, "title": "Add integration test for element find operations", "description": "Write a Go integration test using TextEdit that: traverses accessibility tree, finds elements by role (AXButton), finds by text (containing known menu item), finds by position (near known coordinates), clicks a found element, verifies state change.", "status": "not-started"},
    {"id": 76, "title": "Add integration test for scripting operations", "description": "Write a Go integration test that: executes AppleScript ('return 2+2', verify output '4'), executes JXA, validates a script (valid and invalid), executes shell command ('echo hello', verify stdout). Test timeout handling.", "status": "not-started"},
    {"id": 77, "title": "Add integration test for session lifecycle", "description": "Write a Go integration test for full session lifecycle: create session, get session, begin transaction, perform actions, commit transaction, get snapshot, begin another transaction, rollback, delete session. Verify state changes at each step.", "status": "not-started"},
    {"id": 78, "title": "Add integration test for macro lifecycle", "description": "Write a Go integration test for macro CRUD and execution: create macro (with click action), get macro, list macros, execute macro against Calculator (verify button press via state change), update macro, delete macro.", "status": "not-started"},
    {"id": 79, "title": "Add integration test for display enumeration", "description": "Write a Go integration test for display listing: call list_displays, verify at least one display, verify main display has frame with positive dimensions, visible frame within frame bounds, scale factor >= 1.0. Get display by name.", "status": "not-started"},
    {"id": 80, "title": "Add integration test for window state", "description": "Write a Go integration test that: opens Calculator, gets window state, verifies it reports focused status, minimizes window, verifies minimized state via get_window_state, restores, verifies restored state. Use PollUntil for all state checks.", "status": "not-started"},
    {"id": 81, "title": "Add integration test for multi-window", "description": "Write a Go integration test that: opens two TextEdit windows, lists windows (verifies count >= 2), gets each window independently, moves one window, verifies positions differ, resizes one window, verifies sizes differ. Clean up both.", "status": "not-started"},
    {"id": 82, "title": "Add integration test for observation streaming", "description": "Write a Go integration test that: creates observation on Calculator (window_changes type), performs a resize, verifies observation detects the change event, cancels observation, verifies cancelled state.", "status": "not-started"},
    {"id": 83, "title": "Add integration test for concurrent observations", "description": "Write a Go integration test creating observations on Calculator and TextEdit simultaneously, verify both detect changes independently without focus thrashing, cancel both, verify cleanup.", "status": "not-started"},
    {"id": 84, "title": "Add integration test for MCP stdio transport", "description": "Write a Go integration test that spawns the MCP server binary in stdio mode, sends JSON-RPC initialize, tools/list, tools/call (capture_screenshot) messages via stdin, reads responses from stdout, verifies correct JSON-RPC format.", "status": "not-started"},
    {"id": 85, "title": "Add integration test for MCP HTTP transport", "description": "Write a Go integration test that starts the MCP server in HTTP/SSE mode, sends POST to /message with initialize request, verifies SSE events on /events, tests /health endpoint returns 200.", "status": "not-started"},
    {"id": 86, "title": "Add integration test for file dialog", "description": "Write a Go integration test using Finder that exercises selectFile and selectDirectory operations, verifying path selection and error handling for non-existent paths.", "status": "not-started"},
    {"id": 87, "title": "Add integration test for error scenarios", "description": "Expand error_scenarios_test.go to cover: invalid PID (very large number), non-existent window ID, invalid selector (empty role), permission denied simulation, timeout scenarios for wait_element with very short timeout, invalid page_token.", "status": "not-started"},
    {"id": 88, "title": "Add integration test for end-to-end MCP flow", "description": "Write a Go integration test simulating a real MCP client workflow: initialize -> list tools -> open_application(Calculator) -> list_windows -> capture_screenshot -> traverse_accessibility -> find_elements -> click -> verify state. All in sequence.", "status": "not-started"},
    {"id": 89, "title": "Add integration test for clipboard roundtrip", "description": "Write a Go integration test that: clears clipboard, writes text, reads clipboard back (verify match), writes image data, reads back (verify type is image), gets history (verify entries).", "status": "not-started"},
    {"id": 90, "title": "Add integration test for cursor position", "description": "Write a Go integration test that: moves cursor to known position via move_mouse, calls capture_cursor_position, verifies coordinates match within tolerance (±2px). Tests coordinate system consistency.", "status": "not-started"},
    {"id": 91, "title": "Add integration test for wait element", "description": "Write a Go integration test that: opens Calculator, calls wait_element with selector for a button (should succeed quickly), calls wait_element with short timeout and impossible selector (should timeout), verifies LRO lifecycle (pending -> done).", "status": "not-started"},
    {"id": 92, "title": "Add integration test for element actions", "description": "Write a Go integration test using Calculator: find a button element, get available actions (should include AXPress), perform AXPress action, verify Calculator display changes.", "status": "not-started"},
    {"id": 93, "title": "Add Finder integration test for windows", "description": "Write a Go integration test using Finder: open Finder window, list windows (verify Finder window present), get window metadata (title, bounds), move window, verify new position, close window, verify removed from list.", "status": "not-started"},
    {"id": 94, "title": "Add TextEdit integration test for elements", "description": "Write a Go integration test using TextEdit: open new document, traverse accessibility tree, find text area element (AXTextArea role), write value to text area, read back value, verify match.", "status": "not-started"},
    {"id": 95, "title": "Fix AccessibilityTraversal.swift lint issues", "description": "Remove AccessibilityTraversal.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT in Makefile. Run SwiftLint and SwiftFormat. Fix all warnings: line length, trailing whitespace, identifier naming, etc. Retain the 'swiftlint:disable all' only if truly needed for upstream compatibility.", "status": "not-started"},
    {"id": 96, "title": "Fix InputController.swift lint issues", "description": "Remove InputController.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings. This file handles CGEvent-based input simulation.", "status": "not-started"},
    {"id": 97, "title": "Fix CombinedActions.swift lint issues", "description": "Remove CombinedActions.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 98, "title": "Fix ActionCoordinator.swift lint issues", "description": "Remove ActionCoordinator.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 99, "title": "Fix AppOpener.swift lint issues", "description": "Remove AppOpener.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 100, "title": "Fix DrawVisuals.swift lint issues", "description": "Remove DrawVisuals.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 101, "title": "Fix HighlightInput.swift lint issues", "description": "Remove HighlightInput.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 102, "title": "Fix CLI tool main.swift lint issues", "description": "Remove all CLI tool main.swift files (VisualInputTool, TraversalTool, InputControllerTool, HighlightTraversalTool, AppOpenerTool, ActionTool) from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT. Fix lint/format warnings. Note: fputs/print are allowed in CLI tools per AGENTS.md.", "status": "not-started"},
    {"id": 103, "title": "Fix test file lint exclusions", "description": "Remove CombinedActionsDiffTests.swift and CombinedActionsFocusVisualizationTests.swift from SWIFT_PACKAGE_FILES_NO_LINT_OR_FORMAT and fix all SwiftLint and SwiftFormat warnings.", "status": "not-started"},
    {"id": 104, "title": "Audit Logger privacy in server files", "description": "Audit all Server/Sources/MacosUseServer/*.swift files for Logger calls with interpolated values. Every interpolated value must have explicit .private or .public privacy annotation. Fix any missing annotations. Files to audit: all 35+ Swift files in MacosUseServer/.", "status": "not-started"},
    {"id": 105, "title": "Audit Logger privacy in SDK files", "description": "Audit all Sources/MacosUseSDK/*.swift files for Logger calls with interpolated values missing explicit privacy annotations. Add .private or .public as appropriate. Files: AccessibilityTraversal.swift, WindowQuery.swift, SDKLogger.swift, etc.", "status": "not-started"},
    {"id": 106, "title": "Add nonisolated(unsafe) safety audit", "description": "Audit all uses of nonisolated(unsafe) in server code: ObservationManager.shared (line 12), MacroExecutor.shared (line 51), signalHandler (main.swift line 29). Verify each is initialized before any access. Add runtime guards (preconditionFailure) if the implicitly unwrapped optionals could be nil at access time.", "status": "not-started"},
    {"id": 107, "title": "Add initialization order documentation", "description": "Add inline documentation in main.swift explaining the initialization order: NSApplication.shared -> ServerConfig -> AppStateStore -> OperationStore -> ProductionSystemOperations -> WindowRegistry -> ObservationManager.shared -> MacroExecutor.shared -> MacosUseService. Document why order matters (dependency graph).", "status": "not-started"},
    {"id": 108, "title": "Add graceful shutdown to Swift server", "description": "Implement proper graceful shutdown in main.swift that: cancels all active observations via ObservationManager, invalidates all sessions via SessionManager, drains in-flight RPCs (GRPCServer already handles this), cleans up Unix socket file. Handle SIGTERM signal properly.", "status": "not-started"},
    {"id": 109, "title": "Add graceful shutdown tests", "description": "Write Swift server tests verifying graceful shutdown: observations are cancelled (state changes to .cancelled), sessions are cleaned up, operation store is drained, no deadlock occurs during shutdown.", "status": "not-started"},
    {"id": 110, "title": "Add health check RPC to gRPC server", "description": "Implement grpc.health.v1.Health service in the Swift server for load balancer integration. Return SERVING when server is accepting RPCs, NOT_SERVING during shutdown.", "status": "not-started"},
    {"id": 111, "title": "Add health check integration test", "description": "Write a Go integration test verifying grpc.health.v1.Health Check RPC responds with SERVING status when server is healthy.", "status": "not-started"},
    {"id": 112, "title": "Add Go MCP health endpoint tests", "description": "Write Go tests for the /health HTTP endpoint verifying: correct HTTP 200 status, JSON response body with version and status, correct Content-Type header.", "status": "not-started"},
    {"id": 113, "title": "Add element cache invalidation strategy", "description": "Improve ElementRegistry's 30-second TTL cache. Add invalidation callbacks for: app termination (already in clearElements), window close/destroy events, app deactivation. Register with ChangeDetector for relevant AX notifications.", "status": "not-started"},
    {"id": 114, "title": "Add element cache invalidation tests", "description": "Write Swift server tests for ElementRegistry cache invalidation: elements are evicted on clearElements(forPid:), TTL expiration works correctly, triggerCleanup removes expired elements, concurrent register/evict is safe.", "status": "not-started"},
    {"id": 115, "title": "Add WindowRegistry cache improvement tests", "description": "Write Swift server tests for WindowRegistry: verify invalidate(windowID:) removes cached window, findWindowByPosition returns correct match within tolerance, findWindowByBounds handles ambiguous matches (returns nil), listWindows returns sorted results.", "status": "not-started"},
    {"id": 116, "title": "Add ObservationManager cleanup tests", "description": "Write Swift server tests verifying ObservationManager properly: cleans up polling tasks on cancelObservation, cleans up on failObservation, stream continuations are finished on cancel, creates independent event streams per subscriber.", "status": "not-started"},
    {"id": 117, "title": "Add SessionManager expiration tests", "description": "Expand SessionManagerTests with tests for: session expiration (set short timeout, verify cleanup), concurrent session operations, addApplication/removeApplication tracking, addObservation/removeObservation tracking, getSessionSnapshot includes all data.", "status": "not-started"},
    {"id": 118, "title": "Add MacroRegistry persistence option", "description": "Add optional file-based persistence for MacroRegistry so macros survive server restarts. Implement saveToDisk/loadFromDisk with JSON encoding. Add a config option (env var) for persistence file path. Default to in-memory only.", "status": "not-started"},
    {"id": 119, "title": "Add MacroRegistry persistence tests", "description": "Write Swift tests for MacroRegistry persistence: save to file, load from file, handle corrupted file gracefully, handle missing file on load (start empty), concurrent save/load safety.", "status": "not-started"},
    {"id": 120, "title": "Add Go MCP streaming handler improvement", "description": "Improve the Go MCP stream_observations handler to support long-lived SSE streaming with: proper connection lifecycle management, heartbeat delivery, reconnection hints in errors, and graceful shutdown.", "status": "not-started"},
    {"id": 121, "title": "Add Go MCP streaming tests", "description": "Write Go tests for the streaming observation handler: event delivery, heartbeat timing, connection teardown on observation cancel, graceful shutdown during active stream.", "status": "not-started"},
    {"id": 122, "title": "Expand Go config validation tests", "description": "Expand config_test.go with: all environment variable parsing (every field in Config struct), validation edge cases (negative timeouts, empty strings, invalid duration formats), default values verification, and clear error messages for invalid configurations.", "status": "not-started"},
    {"id": 123, "title": "Add Go transport stdio tests", "description": "Expand stdio_test.go with: proper handling of stdin/stdout closure, EOF detection and clean shutdown, malformed JSON-RPC handling, oversized message handling, concurrent read/write safety.", "status": "not-started"},
    {"id": 124, "title": "Add Go transport HTTP SSE tests", "description": "Expand http_test.go with: SSE heartbeat delivery at configured intervals, client disconnect detection, multiple concurrent SSE connections, message routing to correct SSE client.", "status": "not-started"},
    {"id": 125, "title": "Add Go transport metrics tests", "description": "Expand metrics_test.go with: request counting accuracy, latency tracking (p50/p90/p99 if applicable), error rate calculation, concurrent access safety under high load, reset functionality.", "status": "not-started"},
    {"id": 126, "title": "Verify page token opacity in all RPCs", "description": "Audit all List/Find RPCs in Swift server and Go MCP handlers to verify page_token uses ParsingHelpers.encodePageToken/decodePageToken (base64 opaque). Verify no handler leaks internal offset format to clients. Check: ListApplications, ListWindows, ListInputs, ListSessions, ListMacros, ListObservations, FindElements, FindRegionElements.", "status": "not-started"},
    {"id": 127, "title": "Add page token opacity integration tests", "description": "Write integration tests that: get a next_page_token from a List RPC, use it verbatim in next request (verify it works), pass a modified/invalid token (verify error), pass an empty token (verify first page).", "status": "not-started"},
    {"id": 128, "title": "Add proto backward compatibility tests", "description": "Write Go tests verifying proto message backward compatibility: new fields have zero-value defaults (existing serialized messages still parse), field numbers are not reused, enum values are additive only.", "status": "not-started"},
    {"id": 129, "title": "Add CI integration test workflow", "description": "Create .github/workflows/integration.yaml with workflow_call trigger. Runs on self-hosted macOS runner with accessibility permissions. Runs integration tests via make target. Add to ci.yaml as a separate job.", "status": "not-started"},
    {"id": 130, "title": "Add CI proto lint step", "description": "Add a dedicated step in build.yaml that runs google-api-linter and buf lint as separate steps (not just as part of 'all'), failing on any warnings. Ensure it runs before the build step to catch proto issues early.", "status": "not-started"},
    {"id": 131, "title": "Add CI Go test coverage reporting", "description": "Add Go test coverage measurement to build.yaml: run go test with -coverprofile, generate coverage report, fail if coverage drops below configured threshold (e.g., 70%). Use go tool cover for reporting.", "status": "not-started"},
    {"id": 132, "title": "Add CI Swift test coverage reporting", "description": "Add Swift test coverage to build.yaml: run swift test --enable-code-coverage, extract coverage percentage from .build/debug/codecov/*.json, report in CI output.", "status": "not-started"},
    {"id": 133, "title": "Add CI coverage badges to README", "description": "Add Go and Swift coverage badges to README.md. Use shields.io with CI-generated coverage values. Ensure badges update on main branch pushes.", "status": "not-started"},
    {"id": 134, "title": "Audit CI for set -e usage", "description": "Audit .github/workflows/build.yaml for any use of 'set -e'. The 'Select Latest Stable Xcode' step uses 'set -eu'. Per AGENTS.md mandate, replace with explicit chaining (&&) or condition checks.", "status": "not-started"},
    {"id": 135, "title": "Add CI dependency caching", "description": "Add caching to build.yaml for: Swift Package Manager (~/Library/Caches/org.swift.swiftpm), Go modules (~/go/pkg/mod), and buf cache. Use actions/cache@v4 with appropriate cache keys.", "status": "not-started"},
    {"id": 136, "title": "Add Go staticcheck verification", "description": "Run go staticcheck on all Go packages via make target. Verify it passes cleanly. Add any necessary suppressions with documented justifications. Ensure CI runs this check.", "status": "not-started"},
    {"id": 137, "title": "Add Go vet verification", "description": "Run go vet on all Go packages via make target. Verify it passes cleanly. Ensure CI runs this check as part of the lint step.", "status": "not-started"},
    {"id": 138, "title": "Update README architecture section", "description": "Add/update README.md with: three-layer architecture diagram (Swift SDK -> Swift gRPC Server -> Go MCP Server), hybrid authority model summary, coordinate system quick reference, environment variable reference table.", "status": "not-started"},
    {"id": 139, "title": "Update README MCP tool catalog", "description": "Add a complete MCP tool catalog table to README.md listing all 77 tools organized by category (screenshot, input, element, window, display, clipboard, application, scripting, observation, accessibility, file dialog, session, macro, input query) with brief descriptions.", "status": "not-started"},
    {"id": 140, "title": "Update API reference documentation", "description": "Update docs/ai-artifacts/10-api-reference.md to be complete and current: all RPCs listed with request/response types, all MCP tools with parameters, all resource types with field descriptions, all error codes with meanings and examples.", "status": "not-started"},
    {"id": 141, "title": "Update docs/window-state-management.md", "description": "Ensure docs/window-state-management.md is fully up to date with current implementation: verify authority matrix matches code, verify RPC split description matches WindowMethods.swift, add section on orphan rescue mechanism from ObservationManager, add section on passive observation.", "status": "not-started"},
    {"id": 142, "title": "Update MCP integration documentation", "description": "Update docs/ai-artifacts/05-mcp-integration.md with: protocol version 2025-11-25 compliance status, Resources and Prompts capability status, stdio and HTTP/SSE transport details, rate limiting configuration, audit logging configuration.", "status": "not-started"},
    {"id": 143, "title": "Update MCP tool design documentation", "description": "Update docs/ai-artifacts/06-mcp-tool-design.md to reflect current 77-tool implementation: verify all tools listed, verify descriptions match code, add any missing tools, document input schema patterns.", "status": "not-started"},
    {"id": 144, "title": "Add ServerConfig environment variable docs", "description": "Document all environment variables for both Swift server (GRPC_LISTEN_ADDRESS, GRPC_PORT, GRPC_UNIX_SOCKET) and Go MCP server (MCP_TRANSPORT, MCP_HTTP_ADDR, MCP_API_KEY, MCP_SERVER_ADDR, etc.) in a single reference section.", "status": "not-started"},
    {"id": 145, "title": "Add CHANGELOG entries", "description": "Add CHANGELOG.md entries documenting: activation cycle fix (passive observation default), new activate parameter, circuit breaker, proto annotation improvements, new integration tests, lint cleanup, MCP resources/prompts support.", "status": "not-started"},
    {"id": 146, "title": "Add developer setup documentation", "description": "Document complete developer setup in README.md or CONTRIBUTING.md: Xcode version requirement, Homebrew dependencies (swiftformat, swiftlint, make, buf), accessibility permissions setup, environment variables, first build instructions, running tests.", "status": "not-started"},
    {"id": 147, "title": "Update CONTRIBUTING.md test guidelines", "description": "Add sections to CONTRIBUTING.md covering: PollUntil pattern (with code example), golden application constraint (Calculator/TextEdit/Finder only), fixture lifecycle (SIGKILL before, DeleteApplication after), state-delta assertion requirement (accessor after mutator), no time.Sleep rule.", "status": "not-started"},
    {"id": 148, "title": "Add performance benchmark for traversal", "description": "Write a Swift benchmark (XCTest performance test or standalone) measuring traverseAccessibilityTree performance with Calculator (small tree) and Finder (large tree) to establish baseline metrics. Log element count and duration.", "status": "not-started"},
    {"id": 149, "title": "Add performance benchmark for window listing", "description": "Write a Swift benchmark measuring listWindows performance with: 1 window, 5 windows, 10+ windows. Verify sub-100ms response time for typical case.", "status": "not-started"},
    {"id": 150, "title": "Add performance benchmark for screenshot", "description": "Write a Swift benchmark measuring screenshot capture latency for: PNG vs JPEG vs TIFF, with/without OCR, full screen vs window vs region. Establish baseline metrics.", "status": "not-started"},
    {"id": 151, "title": "Add concurrency stress test for server", "description": "Write a Go test that sends 50 concurrent gRPC requests (mix of list_windows, traverse_accessibility, capture_screenshot, get_clipboard) and verifies: no crashes, no deadlocks, all responses are valid, no data corruption between requests.", "status": "not-started"},
    {"id": 152, "title": "Add memory leak detection for observations", "description": "Write a Swift test that creates and cancels 100 observations in rapid succession, then verifies: ObservationManager observation count is 0, no leaked Task instances (check for task count if possible), no unbounded memory growth.", "status": "not-started"},
    {"id": 153, "title": "Verify make all clean build", "description": "Run a complete clean -> build -> test cycle: make clean, make all. Verify zero warnings from all linters, all tests pass, build output is clean and reproducible. Log results.", "status": "not-started"},
    {"id": 154, "title": "Run full integration test suite", "description": "Run the complete integration test suite (make go.test.integration or equivalent) verifying all tests pass, no focus stealing occurs, proper cleanup happens after each test, and no warnings are emitted.", "status": "not-started"},
    {"id": 155, "title": "Final blueprint.json status update", "description": "Update blueprint.json statusSection to reflect all tasks completed and verified. The codebase should be in a shippable state with: all bugs fixed, exhaustive test coverage, complete documentation, clean CI, and 100% lint compliance.", "status": "not-started"}
  ],
  "continuousVerification": {
    "task": "Run 'make all' with full logging after EVERY significant change",
    "description": "Execute 'make make-all-with-log' after: (a) Each code change, (b) Each test addition, (c) Each task completion, (d) Each bug fix.",
    "failPolicy": "If ANY test fails, STOP IMMEDIATELY and fix the issue before proceeding. Zero tolerance for test failures, timing issues, non-determinism, or race conditions.",
    "testCoverage": "You will ALWAYS aim for 100% effective test coverage, and VERIFY test coverage by means of the tooling available to you. You will NOT proceed to the next task until you have achieved 100% effective test coverage for the current task, and have verified that coverage with the tools available to you."
  },
  "finalEnforcementProtocol": [
    {
      "type": "POST_EXECUTION_WARNING",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    },
    {
      "type": "POST_EXECUTION_WARNING_REPEATED",
      "alert": "ON TOOLS: Use `config.mk` to create custom targets to run with Make. ALWAYS use custom targets that *limit* the amount of output you receive. For example, piping through tail, with FEW lines output. Prior to tail, pipe to tee. The file ./build.log in the root of the project is gitignored, so use that. That way you can *search* the output. To be clear, timing dependent tests are BANNED. As are those that take too long to run. Testing retries, for example, MUST be done in a way that supports avoiding running afoul of those CRITICAL rules. Abide. OBEY."
    }
  ]
}
